[
  [
    "Farnaz Sheikhi and Ali Mohades. Planar maximum box problem revisited. Theoretical Computer Science, 729:57-67, 2018.",
    "https://www.sciencedirect.com/science/article/pii/S0304397518300045"
  ],
  [
    "Farnaz Sheikhi, Ali Mohades, Mark de Berg, and Ali Mehrabi. Separability of imprecise points. Computational Geometry: Theory and Applications, 61:24-37, 2017.",
    "https://www.sciencedirect.com/science/article/abs/pii/S0925772116300992"
  ],
  [
    "Farnaz Sheikhi, Ali Mohades, Mark de Berg, and Mansoor Davoodi. Separating bichromatic point sets by L-shapes. Computational Geometry: Theory and Applications, 48:673-687, 2015.",
    "https://www.sciencedirect.com/science/article/pii/S0925772115000619"
  ],
  [
    "Mansoor Davoodi, Ali Mohades, Farnaz Sheikhi, and Payam Khanteimouri. Data imprecision under Lambda-geometry. Information Sciences, 295:126-144, 2015.",
    "https://www.sciencedirect.com/science/article/pii/S0020025514009992"
  ],
  [
    "Mark de Berg, Ali Mehrabi, and Farnaz Sheikhi. Separability of imprecise points. 14th Scandinavian Symposium and Workshop on Algorithm Theory (SWAT), Lecture Notes in Computer Science, 8503:146-157, 2014.",
    "https://link.springer.com/chapter/10.1007%2F978-3-319-08404-6_13"
  ],
  [
    "Bahareh Banyasady, Farnaz Sheikhi, Mohammad Asgaripour, Ali Mohades, and Ali Najafi. Covering points with outliers by two boxes (in Persian). 2nd Conference on Computer and Information Technology, Tabriz, Iran, 2014.",
    ""
  ],
  [
    "Farnaz Sheikhi, Ali Mohades, and Mansoor Davoodi. An improved algorithm for finding monochromatic L-shapes in bichromatic point sets. In Proc. the Contemporary Issues in Computer and Information Sciences, 36-39, Zanjan, Iran, 2011.",
    ""
  ],
  [
    "Bahram Kouhestani, Farnaz Sheikhi, Mahsa Soheil Shamaee, and Ali Mohades. Guarding a terrain by a single k-modem watchtower. In Proc. the First CSUT Conference on Computer, Communication and Information Technology, 2:344-349, Tabriz, Iran, 2011.",
    ""
  ],
  [
    "Mansoor Davoodi, Payam Khanteimouri, Farnaz Sheikhi, and Ali Mohades. Data imprecision under Lambda-Geometry: finding the largest axis-aligned bounding box. In Proc. the 27th European Workshop on Computational Geometry, 135-138, 2011.",
    ""
  ],
  [
    "Farnaz Sheikhi, Mark de Berg, Ali Mohades, Mansoor Davoodi, and Marzieh Eskandari. Finding monochromatic L-shapes. In Proc. of the Contemporary Issues in Computer and Information Sciences, 24- 28, Zanjan, Iran, 2010.",
    ""
  ],
  [
    "Farnaz Sheikhi, Mark de Berg, Ali Mohades, and Mansoor Davoodi. Finding monochromatic L-shapes in bichromatic point sets. In Proc. the 22nd Canadian Conference on Computational Geometry, 269-272, 2010.",
    ""
  ],
  [
    "Ahmad Javad, Ali Mohades, Mansoor Davoodi, and Farnaz Sheikhi. Convex hull of imprecise points modeled by segments in the plane. In Proc. the 26th European Workshop on Computational Geometry, 193-196, 2010.",
    ""
  ]
]